tutorials/contactAngleTesting/DEP_noSolids/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

nonWetting 
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5;
    rho             [1 -3 0 0 0 0 0] 1;   
}

wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.52e-6; 
    rho             [1 -3 0 0 0 0 0] 789;
}

//Solid Phase
activateSolidMechanics 0;
rho_s           [1 -3 0 0 0 0 0] 2650;    

transportModel  HerschelBulkleyQuemada; 
   
    HerschelBulkleyQuemadaCoeffs
    {
	nu0      [ 0 2 -1 0 0 0 0 ] 1e05;      
        tau0     [ 0 2 -2 0 0 0 0 ] 16; 
	epssMax  [ 0 0 0 0 0 0 0 ] 0.74;
        nuf        [ 0 2 -1 0 0 0 0 ] 1e-6;   
	Dstar    [ 0 0 0 0 0 0 0 ] 1.1; 
        n        [ 0 0 0 0 0 0 0 ] 1;          
    }


invFk0           [0 -2 0 0 0 0 0]  4.88e6;
sigma            [1 0 -2 0 0 0 0]  0.02;
activateCapillarity            0;
activatePorousContactAngle     1;
theta0 			      20;

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  VanGenuchten;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    m 3;
}
