tutorials/contactAngleTesting/DEP_noSolids/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue epss 0
    volScalarFieldValue alpha.wetting 0
);

regions
( 
    // cylinderToCell //center circle
    // {
    //     p1 (0.15 0.15 0);
	// p2 (0.15 0.15 1);
    //     radius 0.009; //0.015
    //     fieldValues
    //     (
    //       volScalarFieldValue epss 0//1e-20
    //     );
    // }    
   
    //  cylinderToCell //center circle
    // {
    //     p1 (0.15 0.15 0);
	// p2 (0.15 0.15 1);
    //     radius 0.007;
    //     fieldValues
    //     (
    //        volScalarFieldValue alpha.wetting 1
    //     );
    // }    

    // boxToCell //wierd square that is offset to make drawing
    // {
    //     box (0.246 0.246 -1) (0.254 0.254 1);
    //     fieldValues
    //     (
    //   //      volScalarFieldValue epss 1	
    //     );
    // }

);



// ************************************************************************* //
